{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ],
        [
          "input_3",
          0,
          0
        ],
        [
          "input_4",
          0,
          0
        ],
        [
          "input_5",
          0,
          0
        ],
        [
          "input_6",
          0,
          0
        ],
        [
          "input_7",
          0,
          0
        ],
        [
          "input_2",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              128,
              128,
              2
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "module": "keras.layers",
          "name": "input_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              2
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5,
              5
            ],
            "name": "conv2d",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "BatchNormalization",
          "config": {
            "axis": [
              3
            ],
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "beta_regularizer": null,
            "center": true,
            "dtype": "float32",
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "name": "batch_normalization",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "batch_normalization",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              2
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5,
              5
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              [
                null,
                128,
                128,
                8
              ],
              [
                null,
                128,
                128,
                8
              ]
            ]
          },
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ],
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "add",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "ReLU",
          "config": {
            "dtype": "float32",
            "max_value": null,
            "name": "re_lu",
            "negative_slope": 0.0,
            "threshold": 0.0,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "re_lu",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "dropout",
            "noise_shape": null,
            "rate": 0.2,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "re_lu",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "dropout",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "BatchNormalization",
          "config": {
            "axis": [
              3
            ],
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "beta_regularizer": null,
            "center": true,
            "dtype": "float32",
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "batch_normalization_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              128,
              128,
              8
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeUniform",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5,
              5
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_3",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              64,
              64,
              8
            ]
          },
          "class_name": "BatchNormalization",
          "config": {
            "axis": [
              3
            ],
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "beta_regularizer": null,
            "center": true,
            "dtype": "float32",
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "batch_normalization_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              64,
              64,
              8
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeUniform",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5,
              5
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_4",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              32,
              32,
              8
            ]
          },
          "class_name": "BatchNormalization",
          "config": {
            "axis": [
              3
            ],
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "beta_regularizer": null,
            "center": true,
            "dtype": "float32",
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "batch_normalization_3",
          "registered_name": null
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              32,
              32,
              2
            ],
            "dtype": "float32",
            "name": "input_2",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "module": "keras.layers",
          "name": "input_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              [
                null,
                32,
                32,
                8
              ],
              [
                null,
                32,
                32,
                2
              ]
            ]
          },
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "dtype": "float32",
            "name": "concatenate",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ],
              [
                "input_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "concatenate",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              32,
              32,
              10
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_5",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              32,
              32,
              8
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 8,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_6",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              32,
              32,
              8
            ]
          },
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d",
            "padding": "valid",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "max_pooling2d",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              16,
              16,
              8
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_7",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              16,
              16,
              16
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_8",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              16,
              16,
              16
            ]
          },
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_1",
            "padding": "valid",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "max_pooling2d_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              8,
              8,
              16
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_9",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_9",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              8,
              8,
              32
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_10",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_10",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              8,
              8,
              32
            ]
          },
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_2",
            "padding": "valid",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "max_pooling2d_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              32
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 64,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_11",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_11",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              64
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 64,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_12",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_11",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_12",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              64
            ]
          },
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "dropout_1",
            "noise_shape": null,
            "rate": 0.5,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_12",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "dropout_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              64
            ]
          },
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_3",
            "padding": "valid",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "max_pooling2d_3",
          "registered_name": null
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2,
              2,
              6
            ],
            "dtype": "float32",
            "name": "input_7",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "module": "keras.layers",
          "name": "input_7",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              [
                null,
                2,
                2,
                64
              ],
              [
                null,
                2,
                2,
                6
              ]
            ]
          },
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "dtype": "float32",
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ],
              [
                "input_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "concatenate_1",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              2,
              2,
              70
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 128,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_13",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_13",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              2,
              2,
              128
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 128,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_14",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_14",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              2,
              2,
              128
            ]
          },
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "dropout_2",
            "noise_shape": null,
            "rate": 0.5,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "dropout_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              2,
              2,
              128
            ]
          },
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "interpolation": "nearest",
            "name": "up_sampling2d",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "up_sampling2d",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              128
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 64,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              2,
              2
            ],
            "name": "conv2d_15",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_15",
          "registered_name": null
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4,
              4,
              6
            ],
            "dtype": "float32",
            "name": "input_6",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "module": "keras.layers",
          "name": "input_6",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              [
                null,
                4,
                4,
                64
              ],
              [
                null,
                4,
                4,
                64
              ],
              [
                null,
                4,
                4,
                6
              ]
            ]
          },
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "dtype": "float32",
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_1",
                0,
                0,
                {}
              ],
              [
                "conv2d_15",
                0,
                0,
                {}
              ],
              [
                "input_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "concatenate_2",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              134
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
              "module": "keras.initializers",
              "registered_name": null
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 64,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "HeNormal",
              "config": {
                "seed": null
              },
              "module": "keras.initializers",
              "registered_name": null
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_16",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "module": "keras.layers",
          "name": "conv2d_16",
          "registered_name": null
        },
        {
          "build_config": {
            "input_shape": [
              null,
              4,
              4,
              64
            ]
          },
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {},
